zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cz_ca/pic32cz_ca91/pic32cz4010ca91100-pinctrl.h
/* pb2_gpio */
#define PB2_GPIO MCHP_PINMUX(b, 2, gpio, gpio)

/* pb2a_eic_extint2 */
#define PB2A_EIC_EXTINT2 MCHP_PINMUX(b, 2, a, periph)

/* pb2b_adc0_ain1 */
#define PB2B_ADC0_AIN1 MCHP_PINMUX(b, 2, b, periph)

/* pb3_gpio */
#define PB3_GPIO MCHP_PINMUX(b, 3, gpio, gpio)

/* pb3a_eic_extint3 */
#define PB3A_EIC_EXTINT3 MCHP_PINMUX(b, 3, a, periph)

/* pb3b_adc0_ain0 */
#define PB3B_ADC0_AIN0 MCHP_PINMUX(b, 3, b, periph)

/* pb4_gpio */
#define PB4_GPIO MCHP_PINMUX(b, 4, gpio, gpio)

/* pb4a_eic_extint4 */
#define PB4A_EIC_EXTINT4 MCHP_PINMUX(b, 4, a, periph)

/* pb5_gpio */
#define PB5_GPIO MCHP_PINMUX(b, 5, gpio, gpio)

/* pb5a_eic_extint5 */
#define PB5A_EIC_EXTINT5 MCHP_PINMUX(b, 5, a, periph)

/* pb6_gpio */
#define PB6_GPIO MCHP_PINMUX(b, 6, gpio, gpio)

/* pb6a_eic_extint6 */
#define PB6A_EIC_EXTINT6 MCHP_PINMUX(b, 6, a, periph)

/* pb6p_ptc_drv11 */
#define PB6P_PTC_DRV11 MCHP_PINMUX(b, 6, p, periph)

/* pb7_gpio */
#define PB7_GPIO MCHP_PINMUX(b, 7, gpio, gpio)

/* pb7a_eic_extint7 */
#define PB7A_EIC_EXTINT7 MCHP_PINMUX(b, 7, a, periph)

/* pb7p_ptc_drv10 */
#define PB7P_PTC_DRV10 MCHP_PINMUX(b, 7, p, periph)

/* pb8_gpio */
#define PB8_GPIO MCHP_PINMUX(b, 8, gpio, gpio)

/* pb8a_eic_extint8 */
#define PB8A_EIC_EXTINT8 MCHP_PINMUX(b, 8, a, periph)

/* pb8p_ptc_drv9 */
#define PB8P_PTC_DRV9 MCHP_PINMUX(b, 8, p, periph)

/* pb9_gpio */
#define PB9_GPIO MCHP_PINMUX(b, 9, gpio, gpio)

/* pb9a_eic_extint9 */
#define PB9A_EIC_EXTINT9 MCHP_PINMUX(b, 9, a, periph)

/* pb9p_ptc_drv8 */
#define PB9P_PTC_DRV8 MCHP_PINMUX(b, 9, p, periph)

/* pb10_gpio */
#define PB10_GPIO MCHP_PINMUX(b, 10, gpio, gpio)

/* pb10a_eic_extint10 */
#define PB10A_EIC_EXTINT10 MCHP_PINMUX(b, 10, a, periph)

/* pb10f_tcc1_wo0 */
#define PB10F_TCC1_WO0 MCHP_PINMUX(b, 10, f, periph)

/* pb10p_ptc_drv7 */
#define PB10P_PTC_DRV7 MCHP_PINMUX(b, 10, p, periph)

/* pb11_gpio */
#define PB11_GPIO MCHP_PINMUX(b, 11, gpio, gpio)

/* pb11a_eic_extint11 */
#define PB11A_EIC_EXTINT11 MCHP_PINMUX(b, 11, a, periph)

/* pb11f_tcc1_wo1 */
#define PB11F_TCC1_WO1 MCHP_PINMUX(b, 11, f, periph)

/* pb11p_ptc_drv6 */
#define PB11P_PTC_DRV6 MCHP_PINMUX(b, 11, p, periph)

/* pb12_gpio */
#define PB12_GPIO MCHP_PINMUX(b, 12, gpio, gpio)

/* pb12a_eic_extint12 */
#define PB12A_EIC_EXTINT12 MCHP_PINMUX(b, 12, a, periph)

/* pb12f_tcc1_wo2 */
#define PB12F_TCC1_WO2 MCHP_PINMUX(b, 12, f, periph)

/* pb12p_ptc_drv5 */
#define PB12P_PTC_DRV5 MCHP_PINMUX(b, 12, p, periph)

/* pb13_gpio */
#define PB13_GPIO MCHP_PINMUX(b, 13, gpio, gpio)

/* pb13a_eic_extint13 */
#define PB13A_EIC_EXTINT13 MCHP_PINMUX(b, 13, a, periph)

/* pb13f_tcc1_wo3 */
#define PB13F_TCC1_WO3 MCHP_PINMUX(b, 13, f, periph)

/* pb13p_ptc_drv4 */
#define PB13P_PTC_DRV4 MCHP_PINMUX(b, 13, p, periph)

/* pb14_gpio */
#define PB14_GPIO MCHP_PINMUX(b, 14, gpio, gpio)

/* pb14a_eic_extint14 */
#define PB14A_EIC_EXTINT14 MCHP_PINMUX(b, 14, a, periph)

/* pb14f_tcc1_wo4 */
#define PB14F_TCC1_WO4 MCHP_PINMUX(b, 14, f, periph)

/* pb14p_ptc_drv3 */
#define PB14P_PTC_DRV3 MCHP_PINMUX(b, 14, p, periph)

/* pb15_gpio */
#define PB15_GPIO MCHP_PINMUX(b, 15, gpio, gpio)

/* pb15a_eic_extint15 */
#define PB15A_EIC_EXTINT15 MCHP_PINMUX(b, 15, a, periph)

/* pb15f_tcc1_wo5 */
#define PB15F_TCC1_WO5 MCHP_PINMUX(b, 15, f, periph)

/* pb15p_ptc_drv2 */
#define PB15P_PTC_DRV2 MCHP_PINMUX(b, 15, p, periph)

/* pb16_gpio */
#define PB16_GPIO MCHP_PINMUX(b, 16, gpio, gpio)

/* pb16a_eic_extint0 */
#define PB16A_EIC_EXTINT0 MCHP_PINMUX(b, 16, a, periph)

/* pb16f_tcc1_wo6 */
#define PB16F_TCC1_WO6 MCHP_PINMUX(b, 16, f, periph)

/* pb16p_ptc_drv1 */
#define PB16P_PTC_DRV1 MCHP_PINMUX(b, 16, p, periph)

/* pb17_gpio */
#define PB17_GPIO MCHP_PINMUX(b, 17, gpio, gpio)

/* pb17a_eic_extint1 */
#define PB17A_EIC_EXTINT1 MCHP_PINMUX(b, 17, a, periph)

/* pb17f_tcc1_wo7 */
#define PB17F_TCC1_WO7 MCHP_PINMUX(b, 17, f, periph)

/* pb17p_ptc_drv0 */
#define PB17P_PTC_DRV0 MCHP_PINMUX(b, 17, p, periph)

/* pb18_gpio */
#define PB18_GPIO MCHP_PINMUX(b, 18, gpio, gpio)

/* pb18b_adc0_ain6 */
#define PB18B_ADC0_AIN6 MCHP_PINMUX(b, 18, b, periph)

/* pc0_gpio */
#define PC0_GPIO MCHP_PINMUX(c, 0, gpio, gpio)

/* pc0a_eic_extint0 */
#define PC0A_EIC_EXTINT0 MCHP_PINMUX(c, 0, a, periph)

/* pc0d_sercom0_pad0 */
#define PC0D_SERCOM0_PAD0 MCHP_PINMUX(c, 0, d, periph)

/* pc0f_tcc0_wo0 */
#define PC0F_TCC0_WO0 MCHP_PINMUX(c, 0, f, periph)

/* pc0j_spi_ixs0_fsync */
#define PC0J_SPI_IXS0_FSYNC MCHP_PINMUX(c, 0, j, periph)

/* pc0m_gclk_io4 */
#define PC0M_GCLK_IO4 MCHP_PINMUX(c, 0, m, periph)

/* pc1_gpio */
#define PC1_GPIO MCHP_PINMUX(c, 1, gpio, gpio)

/* pc1a_eic_extint1 */
#define PC1A_EIC_EXTINT1 MCHP_PINMUX(c, 1, a, periph)

/* pc1d_sercom0_pad1 */
#define PC1D_SERCOM0_PAD1 MCHP_PINMUX(c, 1, d, periph)

/* pc1f_tcc0_wo1 */
#define PC1F_TCC0_WO1 MCHP_PINMUX(c, 1, f, periph)

/* pc1j_spi_ixs0_sck */
#define PC1J_SPI_IXS0_SCK MCHP_PINMUX(c, 1, j, periph)

/* pc1m_gclk_io5 */
#define PC1M_GCLK_IO5 MCHP_PINMUX(c, 1, m, periph)

/* pc2_gpio */
#define PC2_GPIO MCHP_PINMUX(c, 2, gpio, gpio)

/* pc2a_eic_extint1 */
#define PC2A_EIC_EXTINT1 MCHP_PINMUX(c, 2, a, periph)

/* pc2d_sercom0_pad2 */
#define PC2D_SERCOM0_PAD2 MCHP_PINMUX(c, 2, d, periph)

/* pc2f_tcc0_wo2 */
#define PC2F_TCC0_WO2 MCHP_PINMUX(c, 2, f, periph)

/* pc2j_spi_ixs0_sdi */
#define PC2J_SPI_IXS0_SDI MCHP_PINMUX(c, 2, j, periph)

/* pc2m_gclk_io6 */
#define PC2M_GCLK_IO6 MCHP_PINMUX(c, 2, m, periph)

/* pc2p_ptc_eci0 */
#define PC2P_PTC_ECI0 MCHP_PINMUX(c, 2, p, periph)

/* pc3_gpio */
#define PC3_GPIO MCHP_PINMUX(c, 3, gpio, gpio)

/* pc3a_eic_extint3 */
#define PC3A_EIC_EXTINT3 MCHP_PINMUX(c, 3, a, periph)

/* pc3d_sercom0_pad3 */
#define PC3D_SERCOM0_PAD3 MCHP_PINMUX(c, 3, d, periph)

/* pc3f_tcc0_wo3 */
#define PC3F_TCC0_WO3 MCHP_PINMUX(c, 3, f, periph)

/* pc3j_spi_ixs0_sdo */
#define PC3J_SPI_IXS0_SDO MCHP_PINMUX(c, 3, j, periph)

/* pc3m_gclk_io7 */
#define PC3M_GCLK_IO7 MCHP_PINMUX(c, 3, m, periph)

/* pc3p_ptc_eci1 */
#define PC3P_PTC_ECI1 MCHP_PINMUX(c, 3, p, periph)

